In [6]:
import pandas as pd

In [7]:
#given a data in string S, convert it into a DataFrame.

In [8]:
S="person,height,id,country\np1,5.2,1,pakistan\np2,NULL,2,india\np3,5.9,3,portugal"

In [9]:
rows=S.split("\n")
rows

['person,height,id,country',
 'p1,5.2,1,pakistan',
 'p2,NULL,2,india',
 'p3,5.9,3,portugal']

In [10]:
df=[]
for rows in rows:
    d=rows.split(",")
    #to eliminate the rows with atleast one null value
    df.append(d)

data=pd.DataFrame(df[1:], columns=df[0])
data

  person height id   country
0     p1    5.2  1  pakistan
1     p2   NULL  2     india
2     p3    5.9  3  portugal